{"keras_version": "2.0.2", "backend": "tensorflow", "class_name": "Sequential", "config": [{"class_name": "Conv2D", "config": {"dtype": "float32", "batch_input_shape": [null, 48, 48, 1], "filters": 64, "dilation_rate": [1, 1], "trainable": true, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv64_1", "bias_regularizer": null, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "kernel_regularizer": null, "kernel_constraint": null, "data_format": "channels_last", "strides": [1, 1], "activation": "linear", "padding": "same", "kernel_size": [3, 3], "bias_constraint": null}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_1"}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_1", "rate": 0.2}}, {"class_name": "Conv2D", "config": {"bias_regularizer": null, "padding": "same", "filters": 64, "dilation_rate": [1, 1], "trainable": true, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "use_bias": true, "kernel_regularizer": null, "kernel_constraint": null, "name": "conv64_2", "strides": [1, 1], "activation": "linear", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "kernel_size": [3, 3], "bias_constraint": null}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_2"}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_2", "rate": 0.2}}, {"class_name": "MaxPooling2D", "config": {"padding": "valid", "data_format": "channels_last", "strides": [2, 2], "trainable": true, "pool_size": [2, 2], "name": "max_pooling2d_1"}}, {"class_name": "Conv2D", "config": {"bias_regularizer": null, "padding": "same", "filters": 128, "dilation_rate": [1, 1], "trainable": true, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "use_bias": true, "kernel_regularizer": null, "kernel_constraint": null, "name": "conv_128_1", "strides": [1, 1], "activation": "linear", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "kernel_size": [3, 3], "bias_constraint": null}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_3"}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_3", "rate": 0.2}}, {"class_name": "Conv2D", "config": {"bias_regularizer": null, "padding": "same", "filters": 128, "dilation_rate": [1, 1], "trainable": true, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "use_bias": true, "kernel_regularizer": null, "kernel_constraint": null, "name": "conv128_2", "strides": [1, 1], "activation": "linear", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "kernel_size": [3, 3], "bias_constraint": null}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_4"}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_4", "rate": 0.2}}, {"class_name": "MaxPooling2D", "config": {"padding": "valid", "data_format": "channels_last", "strides": [2, 2], "trainable": true, "pool_size": [2, 2], "name": "max_pooling2d_2"}}, {"class_name": "Conv2D", "config": {"bias_regularizer": null, "padding": "same", "filters": 256, "dilation_rate": [1, 1], "trainable": true, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "use_bias": true, "kernel_regularizer": null, "kernel_constraint": null, "name": "conv256_1", "strides": [1, 1], "activation": "linear", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "kernel_size": [3, 3], "bias_constraint": null}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_5"}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_5", "rate": 0.2}}, {"class_name": "Conv2D", "config": {"bias_regularizer": null, "padding": "same", "filters": 256, "dilation_rate": [1, 1], "trainable": true, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "use_bias": true, "kernel_regularizer": null, "kernel_constraint": null, "name": "conv256_2", "strides": [1, 1], "activation": "linear", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "kernel_size": [3, 3], "bias_constraint": null}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_6"}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_6", "rate": 0.2}}, {"class_name": "MaxPooling2D", "config": {"padding": "valid", "data_format": "channels_last", "strides": [2, 2], "trainable": true, "pool_size": [2, 2], "name": "max_pooling2d_3"}}, {"class_name": "Conv2D", "config": {"bias_regularizer": null, "padding": "same", "filters": 512, "dilation_rate": [1, 1], "trainable": true, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "use_bias": true, "kernel_regularizer": null, "kernel_constraint": null, "name": "conv512_1", "strides": [1, 1], "activation": "linear", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "kernel_size": [3, 3], "bias_constraint": null}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_7"}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_7", "rate": 0.2}}, {"class_name": "Conv2D", "config": {"bias_regularizer": null, "padding": "same", "filters": 512, "dilation_rate": [1, 1], "trainable": true, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "use_bias": true, "kernel_regularizer": null, "kernel_constraint": null, "name": "conv512_2", "strides": [1, 1], "activation": "linear", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "kernel_size": [3, 3], "bias_constraint": null}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_8"}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_8", "rate": 0.2}}, {"class_name": "MaxPooling2D", "config": {"padding": "valid", "data_format": "channels_last", "strides": [2, 2], "trainable": true, "pool_size": [2, 2], "name": "max_pooling2d_4"}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dense", "config": {"units": 4096, "trainable": true, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "fc_1", "use_bias": true, "kernel_regularizer": null, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "activation": "linear", "bias_regularizer": null, "bias_constraint": null}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_9"}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_9", "rate": 0.2}}, {"class_name": "Dense", "config": {"units": 4096, "trainable": true, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "fc_2", "use_bias": true, "kernel_regularizer": null, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "activation": "linear", "bias_regularizer": null, "bias_constraint": null}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_10"}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_10", "rate": 0.2}}, {"class_name": "Dense", "config": {"units": 7, "trainable": true, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "dense_1", "use_bias": true, "kernel_regularizer": null, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "activation": "linear", "bias_regularizer": null, "bias_constraint": null}}, {"class_name": "Activation", "config": {"activation": "softmax", "trainable": true, "name": "activation_11"}}]}