{"backend": "tensorflow", "config": {"layers": [{"config": {"batch_input_shape": [null, 1], "dtype": "float32", "name": "input_1", "sparse": false}, "inbound_nodes": [], "class_name": "InputLayer", "name": "input_1"}, {"config": {"batch_input_shape": [null, 1], "dtype": "float32", "name": "input_2", "sparse": false}, "inbound_nodes": [], "class_name": "InputLayer", "name": "input_2"}, {"config": {"input_length": 1, "dtype": "int32", "trainable": true, "embeddings_initializer": {"config": {"seed": null, "minval": -0.05, "maxval": 0.05}, "class_name": "RandomUniform"}, "embeddings_regularizer": null, "name": "embedding_1", "output_dim": 128, "batch_input_shape": [null, 1], "input_dim": 3884, "embeddings_constraint": null, "activity_regularizer": null, "mask_zero": false}, "inbound_nodes": [[["input_1", 0, 0, {}]]], "class_name": "Embedding", "name": "embedding_1"}, {"config": {"input_length": 1, "dtype": "int32", "trainable": true, "embeddings_initializer": {"config": {"seed": null, "minval": -0.05, "maxval": 0.05}, "class_name": "RandomUniform"}, "embeddings_regularizer": null, "name": "embedding_2", "output_dim": 128, "batch_input_shape": [null, 1], "input_dim": 6041, "embeddings_constraint": null, "activity_regularizer": null, "mask_zero": false}, "inbound_nodes": [[["input_2", 0, 0, {}]]], "class_name": "Embedding", "name": "embedding_2"}, {"config": {"name": "flatten_1", "trainable": true}, "inbound_nodes": [[["embedding_1", 0, 0, {}]]], "class_name": "Flatten", "name": "flatten_1"}, {"config": {"name": "flatten_2", "trainable": true}, "inbound_nodes": [[["embedding_2", 0, 0, {}]]], "class_name": "Flatten", "name": "flatten_2"}, {"config": {"name": "concatenate_1", "axis": -1, "trainable": true}, "inbound_nodes": [[["flatten_1", 0, 0, {}], ["flatten_2", 0, 0, {}]]], "class_name": "Concatenate", "name": "concatenate_1"}, {"config": {"kernel_initializer": {"config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "trainable": true, "bias_constraint": null, "name": "dense_1", "kernel_regularizer": null, "use_bias": true, "kernel_constraint": null, "units": 1024, "bias_regularizer": null, "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "relu"}, "inbound_nodes": [[["concatenate_1", 0, 0, {}]]], "class_name": "Dense", "name": "dense_1"}, {"config": {"name": "dropout_1", "rate": 0.3, "trainable": true}, "inbound_nodes": [[["dense_1", 0, 0, {}]]], "class_name": "Dropout", "name": "dropout_1"}, {"config": {"kernel_initializer": {"config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "trainable": true, "bias_constraint": null, "name": "dense_2", "kernel_regularizer": null, "use_bias": true, "kernel_constraint": null, "units": 512, "bias_regularizer": null, "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "relu"}, "inbound_nodes": [[["dropout_1", 0, 0, {}]]], "class_name": "Dense", "name": "dense_2"}, {"config": {"name": "dropout_2", "rate": 0.3, "trainable": true}, "inbound_nodes": [[["dense_2", 0, 0, {}]]], "class_name": "Dropout", "name": "dropout_2"}, {"config": {"kernel_initializer": {"config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "trainable": true, "bias_constraint": null, "name": "dense_3", "kernel_regularizer": null, "use_bias": true, "kernel_constraint": null, "units": 256, "bias_regularizer": null, "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "relu"}, "inbound_nodes": [[["dropout_2", 0, 0, {}]]], "class_name": "Dense", "name": "dense_3"}, {"config": {"name": "dropout_3", "rate": 0.3, "trainable": true}, "inbound_nodes": [[["dense_3", 0, 0, {}]]], "class_name": "Dropout", "name": "dropout_3"}, {"config": {"kernel_initializer": {"config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "trainable": true, "bias_constraint": null, "name": "dense_4", "kernel_regularizer": null, "use_bias": true, "kernel_constraint": null, "units": 64, "bias_regularizer": null, "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "relu"}, "inbound_nodes": [[["dropout_3", 0, 0, {}]]], "class_name": "Dense", "name": "dense_4"}, {"config": {"name": "dropout_4", "rate": 0.3, "trainable": true}, "inbound_nodes": [[["dense_4", 0, 0, {}]]], "class_name": "Dropout", "name": "dropout_4"}, {"config": {"kernel_initializer": {"config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "trainable": true, "bias_constraint": null, "name": "dense_5", "kernel_regularizer": null, "use_bias": true, "kernel_constraint": null, "units": 1, "bias_regularizer": null, "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "relu"}, "inbound_nodes": [[["dropout_4", 0, 0, {}]]], "class_name": "Dense", "name": "dense_5"}], "name": "model_1", "input_layers": [["input_1", 0, 0], ["input_2", 0, 0]], "output_layers": [["dense_5", 0, 0]]}, "class_name": "Model", "keras_version": "2.0.4"}