{"config": {"output_layers": [["add_1", 0, 0]], "layers": [{"config": {"name": "input_1", "dtype": "float32", "sparse": false, "batch_input_shape": [null, 1]}, "inbound_nodes": [], "class_name": "InputLayer", "name": "input_1"}, {"config": {"name": "input_2", "dtype": "float32", "sparse": false, "batch_input_shape": [null, 1]}, "inbound_nodes": [], "class_name": "InputLayer", "name": "input_2"}, {"config": {"input_dim": 6040, "batch_input_shape": [null, null], "activity_regularizer": null, "name": "embedding_1", "embeddings_initializer": {"config": {"stddev": 0.05, "mean": 0.0, "seed": null}, "class_name": "RandomNormal"}, "dtype": "int32", "output_dim": 8, "mask_zero": false, "embeddings_constraint": null, "trainable": true, "embeddings_regularizer": null, "input_length": null}, "inbound_nodes": [[["input_1", 0, 0, {}]]], "class_name": "Embedding", "name": "embedding_1"}, {"config": {"input_dim": 3952, "batch_input_shape": [null, null], "activity_regularizer": null, "name": "embedding_2", "embeddings_initializer": {"config": {"stddev": 0.05, "mean": 0.0, "seed": null}, "class_name": "RandomNormal"}, "dtype": "int32", "output_dim": 8, "mask_zero": false, "embeddings_constraint": null, "trainable": true, "embeddings_regularizer": null, "input_length": null}, "inbound_nodes": [[["input_2", 0, 0, {}]]], "class_name": "Embedding", "name": "embedding_2"}, {"config": {"trainable": true, "name": "flatten_1"}, "inbound_nodes": [[["embedding_1", 0, 0, {}]]], "class_name": "Flatten", "name": "flatten_1"}, {"config": {"trainable": true, "name": "flatten_2"}, "inbound_nodes": [[["embedding_2", 0, 0, {}]]], "class_name": "Flatten", "name": "flatten_2"}, {"config": {"input_dim": 6040, "batch_input_shape": [null, null], "activity_regularizer": null, "name": "embedding_3", "embeddings_initializer": {"config": {"stddev": 0.05, "mean": 0.0, "seed": null}, "class_name": "RandomNormal"}, "dtype": "int32", "output_dim": 1, "mask_zero": false, "embeddings_constraint": null, "trainable": true, "embeddings_regularizer": null, "input_length": null}, "inbound_nodes": [[["input_1", 0, 0, {}]]], "class_name": "Embedding", "name": "embedding_3"}, {"config": {"input_dim": 3952, "batch_input_shape": [null, null], "activity_regularizer": null, "name": "embedding_4", "embeddings_initializer": {"config": {"stddev": 0.05, "mean": 0.0, "seed": null}, "class_name": "RandomNormal"}, "dtype": "int32", "output_dim": 1, "mask_zero": false, "embeddings_constraint": null, "trainable": true, "embeddings_regularizer": null, "input_length": null}, "inbound_nodes": [[["input_2", 0, 0, {}]]], "class_name": "Embedding", "name": "embedding_4"}, {"config": {"trainable": true, "name": "dot_1", "normalize": false, "axes": 1}, "inbound_nodes": [[["flatten_1", 0, 0, {}], ["flatten_2", 0, 0, {}]]], "class_name": "Dot", "name": "dot_1"}, {"config": {"trainable": true, "name": "flatten_3"}, "inbound_nodes": [[["embedding_3", 0, 0, {}]]], "class_name": "Flatten", "name": "flatten_3"}, {"config": {"trainable": true, "name": "flatten_4"}, "inbound_nodes": [[["embedding_4", 0, 0, {}]]], "class_name": "Flatten", "name": "flatten_4"}, {"config": {"trainable": true, "name": "add_1"}, "inbound_nodes": [[["dot_1", 0, 0, {}], ["flatten_3", 0, 0, {}], ["flatten_4", 0, 0, {}]]], "class_name": "Add", "name": "add_1"}], "input_layers": [["input_1", 0, 0], ["input_2", 0, 0]], "name": "model_1"}, "keras_version": "2.0.4", "backend": "tensorflow", "class_name": "Model"}