{"class_name": "Sequential", "config": [{"class_name": "Embedding", "config": {"mask_zero": false, "name": "embedding_1", "batch_input_shape": [null, 313], "embeddings_regularizer": null, "input_length": 313, "output_dim": 200, "input_dim": 51934, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"seed": null, "minval": -0.05, "maxval": 0.05}}, "dtype": "int32", "embeddings_constraint": null, "trainable": false, "activity_regularizer": null}}, {"class_name": "GRU", "config": {"return_sequences": true, "name": "gru_1", "recurrent_constraint": null, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}}, "dropout": 0.5, "recurrent_dropout": 0.5, "activation": "tanh", "stateful": false, "use_bias": true, "implementation": 0, "unroll": false, "bias_regularizer": null, "units": 256, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "bias_constraint": null, "recurrent_activation": "hard_sigmoid", "bias_initializer": {"class_name": "Zeros", "config": {}}, "go_backwards": false, "kernel_regularizer": null, "trainable": true, "recurrent_regularizer": null, "activity_regularizer": null}}, {"class_name": "GRU", "config": {"return_sequences": false, "name": "gru_2", "recurrent_constraint": null, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}}, "dropout": 0.5, "recurrent_dropout": 0.5, "activation": "tanh", "stateful": false, "use_bias": true, "implementation": 0, "unroll": false, "bias_regularizer": null, "units": 256, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "bias_constraint": null, "recurrent_activation": "hard_sigmoid", "bias_initializer": {"class_name": "Zeros", "config": {}}, "go_backwards": false, "kernel_regularizer": null, "trainable": true, "recurrent_regularizer": null, "activity_regularizer": null}}, {"class_name": "Dense", "config": {"name": "dense_1", "bias_regularizer": null, "units": 256, "bias_constraint": null, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "elu", "use_bias": true, "kernel_regularizer": null, "trainable": true, "activity_regularizer": null}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_1", "rate": 0.5}}, {"class_name": "Dense", "config": {"name": "dense_2", "bias_regularizer": null, "units": 128, "bias_constraint": null, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "elu", "use_bias": true, "kernel_regularizer": null, "trainable": true, "activity_regularizer": null}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_2", "rate": 0.5}}, {"class_name": "Dense", "config": {"name": "dense_3", "bias_regularizer": null, "units": 64, "bias_constraint": null, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "elu", "use_bias": true, "kernel_regularizer": null, "trainable": true, "activity_regularizer": null}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_3", "rate": 0.5}}, {"class_name": "Dense", "config": {"name": "dense_4", "bias_regularizer": null, "units": 38, "bias_constraint": null, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "use_bias": true, "kernel_regularizer": null, "trainable": true, "activity_regularizer": null}}, {"class_name": "Activation", "config": {"activation": "sigmoid", "trainable": true, "name": "activation_1"}}], "keras_version": "2.0.2", "backend": "tensorflow"}